// 游戏数据
// 定义成语结构体
struct idioms_type1 {
    char word[16];          // 成语名
    char homophonic[16];    // 成语谐音
    char question[1000];    // 题目描述
    char explain[1000];     // 成语的解释
    char answer;            // 成语的答案
};

struct idioms_type2 {
    char word[16];          // 成语名
    char explain[1000];     // 成语的解释
    char answer;      // 成语的答案
};

struct idioms_type3 {
    char word[16];          // 成语名
    char homophonic[16];    // 成语谐音
    char explain[1000];     // 成语的解释
    char new_explain[1000]; // 成语的新译
    char answer;      // 成语的答案
};

// 全局定义成语数组
struct idioms_type1 idioms_type1_arr[20] = {
        // 富强
        [0] = {
                "安如磐石",
                "",
                "面对疫情，我们应该____，不能自乱阵脚。",
                "安：安稳。磐石：大石头。像磐石那样安稳不动。\n    形容非常稳固，不可动摇。",
                'A'
        },
        [1] = {
                "国富民安",
                "",
                "正是因为我们的经济社会发展，____，面对疫情，\n    我们才能临危不乱，沉着应对。",
                "国家富足，人民安乐。",
                'C'
        },
        [2] = {
                "太平盛世",
                "",
                "在如今的____下，疫情是一场看不见的战争，\n    我们要坚决打赢这场战争。",
                "比喻社会安定、政治清明、经济繁荣的时代。",
                'C'
        },
        // 民主
        [3] = {
                "百家争鸣",
                "",
                "在抗疫战场上，我国的医疗研究机构各显身手，可谓是____。",
                "原指战国时期儒、墨、法、道等各家学说蜂拥而起，各\n    种流派互相争论、互相批评的局面。\n    现比喻学术上不同学派的自由争论。",
                'B'
        },
        [4] = {
                "民贵君轻",
                "",
                "越是在灾难面前，越能看出党对人民的关心，\n    更能体现出我国作为社会主义国家的____。",
                "人民比君主更重要。这是民本思想。",
                'A'
        },
        [5] = {
                "人心所归",
                "",
                "正是因为党在疫情中一心为民，才能____。",
                "指众人所归向、拥护的。",
                'C'
        },
        // 文明
        [6] = {
                "礼尚往来",
                "",
                "在疫情中，我们要____，不能自恃自负。",
                "礼：礼节。尚：崇尚，重视。礼节上重视有来有往。\n    现在也指你对我如何，我便对你如何。",
                'A'
        },
        [7] = {
                "尊贤爱才",
                "",
                "不能等到像疫情这样的灾难出现时，才想起____，\n    而应该贯彻到日常生活中。",
                "爱惜人才。",
                'B'
        },
        // 和谐
        [8] = {
                "爱民如子",
                "",
                "从主席多次亲临抗议一线，不难看出，习主席是\n    一位____的好主席。",
                "爱护老百姓就像爱护自己的子女一样。多用作对\n    官吏或帝王的称颂之词。",
                'B'
        },
        [9] = {
                "安富恤贫",
                "",
                "面对灾难，首先要做的就是____，全国人\n    民团结一心，共渡难关。",
                "安：安定。恤：救济。安定富有的人，救济贫穷的人。",
                'A'
        },
        // 自由
        [10] = {
                "各安生业",
                "",
                "即便现在大家或多或少都受到了疫情的影响，\n    但我们不难放弃生活，仍应____。",
                "各自安于赖以生活的职业。生业：谋生之业。",
                'C'
        },
        // 平等
        [11] = {
                "法不阿贵",
                "",
                "无论是大富豪，又或是留学生，都必须遵守抗疫规\n    定，不应有特权，无论在哪，____。",
                "法律即使是对高贵的人，有权势的人也不徇情；形\n    容执法公正，法律面前人人平等。",
                'B'
        },
        [12] = {
                "一视同仁",
                "",
                "无论是谁，在抗疫政策面前都应____，否则，\n    抗疫战士们做出的努力将会功亏一篑。",
                "表示对人同等看待，不分厚薄。",
                'C'
        },
        [13] = {
                "史无前例",
                "",
                "1月23日，武汉这座有1000多万人口、素\n    有“九省通衢”之称的城市，\n    "
                "____地宣布公交地铁暂停运营，机场火车站离汉通道\n    暂时关闭，打响了疫情防控的人民战争。",
                "指的是历史上从来没有过的事，即前所未有。",
                'A'
        },
        [14] = {
                "众志成城",
                "",
                "当前，全国上下、团结一心展开疫情防控\n    阻击战，____，共克时艰。",
                "比喻团结一致，力量无比强大。",
                'B'
        },
        [15] = {
                "同舟共济",
                "",
                "战疫情，当____。这不仅是一场医疗人\n    员的战斗，更是一场全民的战斗。",
                "比喻团结互助，同心协力，战胜困难。也比喻利害相同。",
                'B'
        }
};

struct idioms_type2 idioms_type2_arr[20] = {
    [0] = {
            "无妄之灾",
            "指平白无故受到的灾祸或损害。",
            'C'
    },
    [1] = {
            "逆流而上",
            "逆水前进，比喻迎着困难而上。",
            'A'
    },
    [2] = {
            "雪中送炭",
            "比喻在别人急需时给以帮助。",
            'B'
    },
    [3] = {
            "分秒必争",
            "一分一秒都必须争取，指时间抓得很紧。",
            'C'
    },
    [4] = {
            "老而弥坚",
            "人虽已老，但志向却更加坚定。",
            'A'
    },
    [5] = {
            "披肝沥胆",
            "比喻开诚相见，竭尽忠诚。",
            'B'
    },
    [6] = {
            "披坚执锐",
            "穿着坚固的铠甲手拿锋利的武器，多指奔赴战场作战。",
            'C'
    },
    [7] = {
            "巾帼须眉",
            "具有男子汉气概的女子。",
            'A'
    },
    [8] = {
            "风华正茂",
            "形容青年朝气蓬勃、奋发有为的精神面貌。",
            'B'
    },
    [9] = {
            "以身许国",
            "把自己的身体献给国家，指尽忠报国，临难不顾。",
            'C'
    },
    [10] = {
            "冬日可爱",
            "如同冬天里的太阳那样使人感到温暖、亲切，\n    比喻人态度温和慈爱，使人愿意接近。",
            'A'
    },
    [11] = {
            "气定神闲",
            "形容人悠闲镇定的样子。",
            'B'
    },
    [12] = {
            "守望相助",
            "邻近的村落为防御外来侵害，协同看守瞭望，\n    遇事互相援助，也泛指彼此关照，互相帮助。",
            'C'
    },
    [13] = {
            "高抬明镜",
            "比喻官吏执法严明，判案公正。",
            'A'
    }
};

struct idioms_type3 idioms_type3_arr[20] = {
        [0] = {
                "通风报信",
                "通风报信",
                "把对立双方中一方的机密暗中告诉另一方。",
                "定时开窗通风，也要时常汇报自己的情况。",
                'B'
        },
        [1] = {
                "敬而远之",
                "敬而远之",
                "表示尊敬却有所顾虑不愿接近。",
                "人和人保持一定距离，就是对对方的尊敬。",
                'A'
        },
        [2] = {
                "不约而同",
                "不约而同",
                "指事先没有约定而相互一致。",
                "不约会，这是大家都同意的。",
                'C'
        },
        [3] = {
                "别来无恙",
                "别来无恙",
                "作别后通信或重逢时的问候语，意思是自从离别以\n    来没有任何坏的事情发生。",
                "只要别来聚会，就会减少得病的风险。",
                'B'
        },
        [4] = {
                "一意孤行",
                "一疫孤行",
                "一意孤行，指不接受别人的劝告，顽固地按照自己\n    的主观想法去做。",
                "生了病就被隔离，不能和别人同行。",
                'A'
        },
        [5] = {
                "招摇过市",
                "罩摇过市",
                "指在人多的地方大摇大摆显示声势，引人注意。",
                "形容有口罩的人才能去菜市场买菜。",
                'C'
        },
        [6] = {
                "麻痹大意",
                "麻痹大疫",
                "麻痹大意，比喻失去警觉。指粗心、疏忽，对事物不\n    敏感，失去警惕性。",
                "不认真做好防护，就会生病。",
                'B'
        },
        [7] = {
                "劳逸结合",
                "劳疫结合",
                "工作和休息相结合。",
                "形容当代年轻人，疫情期间在家远程办公从996\n    变成007的景象。",
                'A'
        },
        [8] = {
                "薄情寡义",
                "薄情寡疫",
                "形容一个人不重感情,比较冷血,也就是背信弃义,\n    无情无义的意思。",
                "减少聚会串门联络感情，才能减少被传染的几率。",
                'C'
        },
        [9] = {
                "艺不压身",
                "疫不压身",
                "艺不压身，技艺不会压垮身体，比喻人学会的技艺\n    越多越好。",
                "我们不会被疫情打倒。",
                'B'
        },
        [10] = {
                "义不容辞",
                "疫不容辞",
                "指道义上不允许推辞。",
                "形容在疫情面前，白衣天使和其他影响们逆向\n    而行的感人精神。",
                'A'
        },
        [11] = {
                "一心一意",
                "一心一疫",
                "形容做事专心一意，一门心思地只做一件事。",
                "万众一心，让疫情抬屁股走人。",
                'C'
        },
        [12] = {
                "花枝招展",
                "花枝罩展",
                "形容打扮得十分艳丽。",
                "花再多心思打扮，别人看见的也就是个大口罩。",
                'C'
        },
        [13] = {
                "互相照应",
                "互相罩应",
                "指相互爱惜。",
                "人人都要佩戴口罩。",
                'B'
        },
        [14] = {
                "行之有效",
                "行之有消",
                "实行起来有成效;指某种方法或措施已经实行过，\n    证明很有效用。",
                "每日坚持对所有场所进行消毒。",
                'A'
        },
        [15] = {
                "以防不测",
                "以防不测",
                "指用来防备不曾料想到的事。",
                "逐个测量体温，把好入口防控关。",
                'C'
        },
        [16] = {
                "临危不惧",
                "临危不聚",
                "面临着危险从容不迫，毫不畏惧。",
                "疫情当前，少扎堆，少聚集。",
                'A'
        },
        [17] = {
                "沾沾自喜",
                "沾沾自洗",
                "形容自以为不错而得意的样子。",
                "坚持勤洗手，是最有效的防护。",
                'B'
        },
        [18] = {
                "大吃一惊",
                "大吃疫惊",
                "形容对发生的事感到十分意外。",
                "现在扎堆大吃大喝，疫情防控令人心惊胆战。",
                'C'
        },
        [19] = {
                "以毒攻毒",
                "以独攻毒",
                "指用有毒的药物来治疗因毒而起的疾病，后用于实际生\n    活，指利用某一种有坏处的事物来抵制另一种\n    有坏处的事物。",
                "尽量独处，避免扎堆，才能击败新冠病毒。",
                'A'
        }
};

char *word_list[] = {"春暖花开","冷言冷语","前思后想","念念不忘","安身立命","百花齐放","窗明几净","白手起家","答非所问","顶天立地","别有洞天","和风细雨","古今中外","南来北往","你追我赶","柳绿花红","面红耳赤","先入为主","成家立业","水深火热","一团和气","张灯结彩","一五一十","再三再四","三更半夜","山清水秀","深情厚谊","十指连心","诗情画意","十全十美","诗情画意","长年累月","不由自主","取长补短","一事无成","头头是道","走马观花","拔苗助长","热火朝天","一往无前","莺歌燕舞","语重心长","桃红柳绿","心直口快","一路平安","答非所问","安身立命","非亲非故","别有洞天","白手起家","冷言冷语","和风细雨","念念不忘","顶天立地","面红耳赤","南来北往","落地生根","山清水秀","先来后到","你追我赶","青山绿水","水秀山明","百无是处","炎黄子孙","山清水秀","答非所问","安身立命","非亲非故","别有洞天","白手起家","冷言冷语","和风细雨","念念不忘","顶天立地","面红耳赤","南来北往","先来后到","你追我赶","先人后己","先入为主","古今中外","千人一面","前思后想","千军万马","春暖花开","百花齐放","窗明几净","十字路口","张三李四","众多非一"};
                     